test_cases/boundary_layer_1D/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1.25e-7;

boundaryField
{    
    top
    {
        type            symmetryPlane;
    }
    
    bottom
    {
        type            fixedValue;
        value           uniform 0.0;
    }
    
    left
    {
        type            cyclic;
    }
    
    right
    {
        type            cyclic;
    }
    
    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }

}


// ************************************************************************* //
