test_cases/boundary_layer_1D/Allrun.singularity
#!/bin/bash
cd "${0%/*}" || exit     # run from this directory
. ../../functions        # singularity run functions
#------------------------------------------------------------------------------

# dummy file for post-processing with paraview
touch post.foam

# mesh creation
singularityRun blockMesh

# solver execution
singularityRun pimpleFoam

#------------------------------------------------------------------------------